Revit 2025 API
WorksetConfigurationOption Enumeration
 A collection of options used to initialize a WorksetConfiguration.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum WorksetConfigurationOption
Public Enumeration WorksetConfigurationOption
public enum class WorksetConfigurationOption
type WorksetConfigurationOption
Members
Member name | Value | Description
OpenAllWorksets | 0 |  Open all user-created worksets by default. Additional open requests will be ignored for this type of configuration.
CloseAllWorksets | 1 |  Close all user-created worksets by default. Additional close requests will be ignored for this type of configuration.
OpenLastViewed | 2 |  Close all user-created worksets by default, but open last viewed worksets.
See Also
Reference
Autodesk.Revit.DB Namespace